Revit 2024 API
Application.Cities Property
Returns a set of all the known city locations within Revit.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public CitySet Cities { get; }
Visual Basic
Public ReadOnly Property Cities As CitySet
	Get
Visual C++
public:
property CitySet^ Cities {
	CitySet^ get ();
}
Remarks
Each city has information about longitude, latitude etc.
Examples
CopyC#
// Get all Revit support cities
Autodesk.Revit.DB.CitySet cities = application.Cities;
// Set all Revit support cities into an ArrayList
System.Collections.ArrayList cityList = new System.Collections.ArrayList();
foreach (Autodesk.Revit.DB.City city in cities)
{
    cityList.Add(city);
}
CopyVB.NET
' Get all Revit support cities
Dim cities As Autodesk.Revit.DB.CitySet = application.Cities
' Set all Revit support cities into an ArrayList
Dim cityList As New System.Collections.ArrayList()
For Each city As Autodesk.Revit.DB.City In cities
    cityList.Add(city)
Next
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace